app/controllers/admin/depts_controller.rb

  def index
    @depts = Dept.all
---
SELECT * FROM "depts"

  def show
    @dept = Dept.find(params[:id])
---
SELECT * FROM "depts" WHERE ("depts"."id" = 1) LIMIT 1

  def edit
    @dept = Dept.find(params[:id])
---
SELECT * FROM "depts" WHERE ("depts"."id" = 1) LIMIT 1

  def create
    @dept = Dept.new(params[:dept])

   if @dept.save
---
INSERT INTO "depts" ("name", "created_at", "updated_at") VALUES('來來豆漿', '2010-01-04 09:30:14', '2010-01-04 09:30:14')

  def update
    @dept = Dept.find(params[:id])

      if @dept.update_attributes(params[:dept])
---
UPDATE "depts" SET "updated_at" = '2010-01-04 09:28:28', "name" = '金融科系-c' WHERE "id" = 6

  def destroy
    @dept = Dept.find(params[:id])
    @dept.destroy
---
SELECT * FROM "depts" WHERE ("depts"."id" = 1) LIMIT 1
DELETE FROM "depts" WHERE "id" = 7