app/controllers/depts_controller.rb

SELECT * FROM "depts"
---
  def index
    @depts = Dept.all

SELECT * FROM "depts" WHERE ("depts"."id" = 1) LIMIT 1
---
  def show
    @dept = Dept.find(params[:id])

SELECT * FROM "depts" WHERE ("depts"."id" = 1) LIMIT 1
---
  def edit
    @dept = Dept.find(params[:id])

INSERT INTO "depts" ("name", "created_at", "updated_at") VALUES('資訊管理系', '2009-12-27 12:29:37', '2009-12-27 12:29:37')
---
  def create
    @dept = Dept.new(params[:dept])

    respond_to do |format|
      if @dept.save

UPDATE "depts" SET "updated_at" = '2010-01-04 05:47:49', "name" = '資管科' WHERE "id" = 5
---
  def update
    @dept = Dept.find(params[:id])

    respond_to do |format|
      if @dept.update_attributes(params[:dept])

SELECT * FROM "depts" WHERE ("depts"."id" = 2) LIMIT 1
DELETE FROM "depts" WHERE "id" = 2
---
  def destroy
    @dept = Dept.find(params[:id])
    @dept.destroy