app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 1)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "created_at", "dept_id", "updated_at", "sex", "email") VALUES('何言風', '2009-12-27 16:49:32', 2, '2009-12-27 16:49:32', 'M', '')

  def edit
    @student = Student.find(params[:id])
---
SELECT * FROM "students" WHERE ("students"."id" = 2)

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT * FROM "students" WHERE ("students"."id" = 2)
UPDATE "students" SET "updated_at" = '2009-12-27 15:22:45', "email" = 'sweet@heart.com.tw' WHERE "id" = 2

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT * FROM "students" WHERE ("students"."id" = 1)
DELETE FROM "students" WHERE "id" = 1