app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT * FROM "teachers" LIMIT 1

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)

  def create
    @teacher = Teacher.new(params[:teacher])

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "dept_id", "created_at", "updated_at", "tel", "office") VALUES('Chris Sun', 1, '2009-12-27 13:17:01', '2009-12-27 13:17:01', '#1968', '忠孝樓')

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)

  def update
    @teacher = Teacher.find(params[:id])

    respond_to do |format|
      if @teacher.update_attributes(params[:teacher])
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)
UPDATE "teachers" SET "updated_at" = '2009-12-27 13:25:55', "name" = 'Henry Huang' WHERE "id" = 3

  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 2)
DELETE FROM "teachers" WHERE "id" = 2