app/controllers/users_controller.rb

  def create
    if User::ALLOWED_USER_TYPES.include?(params[:user][:type])
      @user = params[:user][:type].constantize.new(params[:user])

      if @user.save
---
SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1
INSERT INTO "users" ("name", "single_access_token", "last_request_at", "created_at", "dept_id", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "type", "sex", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES(NULL, '8fBvKrTV-FE9kM2kvICR', '2010-01-04 07:16:38', '2010-01-04 07:16:38', NULL, '48168e48d780e59aed9d1aeca0207ee081406d23c0976dcf6ededf86791114ddb20550baf3b8114f0367a1daaac97945f73953009cdd6d649b8169fee7e7d07f', '5O6CcqFQ15b1ggS8jkVs', '2010-01-04 07:16:38', 0, '127.0.0.1', 'ZhQkzqIPZ9jn_xH-s56Y', '2010-01-04 07:16:38', NULL, NULL, '1d792aea16c06617bca8c16d50001b495a466889d42687cfeaac5cdf44ec7754cca15e5f66d904f22c3c49d8689dcd80b88766d234c81dc7e7a6f9bb64e05ee8', 1, NULL, 'admin', NULL, NULL)